#### BuiltInFailures.StructuralLoadFailures Members

---

|  |
| --- |
| BuiltInFailures StructuralLoadFailures Class   Properties   See Also |

Provides a container of all Revit built-in FailureDefinitionId instances.

The  BuiltInFailures StructuralLoadFailures  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | CannotMirrorBoundaryCondition | Can't mirror Boundary Conditions |
| Public property Static member | CannotMoveBoundaryCondition | Can't move Boundary Conditions |
| Public property Static member | CannotPlaceBoundaryConditions | A boundary condition is already created on the selected element. Duplicate boundary conditions are not allowed. Click the Replace button to delete previous definition of boundary condition or cancel the operation. |
| Public property Static member | HostChangeDisallowsLoadOrBoundaryConditions | Some Hosted Loads or BoundaryConditions lost their References. They will be deleted. |

# See Also

BuiltInFailures StructuralLoadFailures Class

Autodesk.Revit.DB Namespace